In [1]:
import arrow
import pandas as pd
from datetime import datetime
import numpy as np

def convert_todate(df, column_name):
    data_series = []
    len_data = len(df[column_name])
    for idx in range(len_data):
        data = df[column_name].iloc[idx]
        try:
            at = arrow.get(data)
            date = at.date()
            data = date
        except: # jika NAN or NAT
            data = "0000-00-00"

        data_series.append(data)

    df[column_name] = data_series
    return df

In [2]:
df = pd.read_csv("../data/ASET_TANAH.csv", sep='|', encoding='ISO-8859-1')

In [3]:
df.head()

,KODE_KL,NAMA_KL,KODE_KPKNL,NAMA_KPKNL,KODE_SATKER,NAMA_SATKER,KODE_SUB_SATKER,NAMA_SUB_SATKER,KELOMPOK,SUB_KELOMPOK,...,STATUS_PENGGUNAAN,JENIS_PENGGUNA,KD_SATKER_PENGGUNA,UR_SATKER_PENGGUNA,ALAMAT_SATKER_PENGGUNA,STATUS_SBSN,STATUS_IDLE,TGL_TARIK,GPS_LATITUDE,GPS_LONGITUDE
0,60,KEPOLISIAN NEGARA RI,1102.0,KPKNL LHOKSEUMAWE,060010600640192000KD,POLRES ACEH TENGAH,060010600640192000KD,POLRES ACEH TENGAH,TANAH PERSIL,TANAH UNTUK BANGUNAN TEMPAT KERJA,...,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN
1,60,KEPOLISIAN NEGARA RI,1102.0,KPKNL LHOKSEUMAWE,060010600654720000KD,POLRES BIREUEN,060010600654720000KD,POLRES BIREUEN,TANAH PERSIL,TANAH UNTUK BANGUNAN TEMPAT KERJA,...,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN
2,60,KEPOLISIAN NEGARA RI,1102.0,KPKNL LHOKSEUMAWE,060010600665072000KD,POLRES GAYO LUES,060010600665072000KD,POLRES GAYO LUES,TANAH PERSIL,TANAH UNTUK BANGUNAN TEMPAT KERJA,...,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN
3,60,KEPOLISIAN NEGARA RI,1101.0,KPKNL BANDA ACEH,060010600665090000KD,POLRES NAGAN RAYA,060010600665090000KD,POLRES NAGAN RAYA,TANAH PERSIL,TANAH UNTUK BANGUNAN TEMPAT KERJA,...,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN
4,60,KEPOLISIAN NEGARA RI,1102.0,KPKNL LHOKSEUMAWE,060010600665857000KD,POLRES ACEH TIMUR,060010600665857000KD,POLRES ACEH TIMUR,TANAH PERSIL,TANAH BANGUNAN PERUMAHAN/G.TEMPAT TINGGAL,...,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN

In [4]:
df.columns

Index(['KODE_KL', 'NAMA_KL', 'KODE_KPKNL', 'NAMA_KPKNL', 'KODE_SATKER',
       'NAMA_SATKER', 'KODE_SUB_SATKER', 'NAMA_SUB_SATKER', 'KELOMPOK',
       'SUB_KELOMPOK', 'KODE_BARANG', 'NAMA_BARANG', 'NUP', 'NO_KIB',
       'TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA',
       'NILAI_PEROLEHAN_PERTAMA', 'NILAI_MUTASI', 'NILAI_PEROLEHAN',
       'NILAI_PENYUSUTAN', 'NILAI_BUKU', 'KONDISI', 'MERK', 'KUANTITAS',
       'KODE_PROVINSI', 'URAIAN_PROVINSI', 'KODE_KAB_KOTA', 'URAIAN_KAB_KOTA',
       'KECAMATAN', 'KELURAHAN_DESA', 'KODE_POS', 'RT_RW', 'ALAMAT',
       'ALAMAT_LAINNYA', 'LUAS_TANAH_SELURUHNYA', 'LUAS_TANAH_UNTUK_BANGUNAN',
       'LUAS_TANAH_SARANA_LINGKUNGAN', 'LUAS_TANAH_KOSONG', 'SBSK',
       'OPTIMALISASI', 'NO_DANA', 'TGL_DANA', 'DARI', 'ASL_PERLH', 'TGL_PERLH',
       'NO_PSP', 'TGL_PSP', 'JUMLAH_FOTO', 'JUMLAH_KIB', 'JENIS_SERTIFIKAT',
       'KEPEMILIKAN', 'JENIS_DOKUMEN', 'STATUS_PENGELOLAAN',
       'STATUS_PENGGUNAAN', 'JENIS_PENGGUNA', 'KD_SATKER_PENGGUNA',
       'UR_SATKER_PENGGUNA', 'ALAMAT_SATKER_PENGGUNA', 'STATUS_SBSN',
       'STATUS_IDLE', 'TGL_TARIK', 'GPS_LATITUDE', 'GPS_LONGITUDE'],
      dtype='object')

In [5]:
cname = ['TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA', 'TGL_DANA', 'TGL_PERLH', 'TGL_PSP',
        'TGL_TARIK']

In [6]:
len(cname)

8

In [7]:
df[cname[0]]

0        1973-10-24 00:00:00.0000000
1        2004-03-25 00:00:00.0000000
2        1995-12-31 00:00:00.0000000
3        2010-01-01 00:00:00.0000000
4        2008-04-01 00:00:00.0000000
                    ...
10843    1981-01-02 00:00:00.0000000
10844    1989-10-02 00:00:00.0000000
10845    1991-03-26 00:00:00.0000000
10846    2005-03-14 00:00:00.0000000
10847    1999-01-01 00:00:00.0000000
Name: TANGGAL_PEROLEHAN, Length: 10848, dtype: object

In [8]:
df = convert_todate(df, column_name=cname[0])
df[cname[0]]

0        1973-10-24
1        2004-03-25
2        1995-12-31
3        2010-01-01
4        2008-04-01
            ...
10843    1981-01-02
10844    1989-10-02
10845    1991-03-26
10846    2005-03-14
10847    1999-01-01
Name: TANGGAL_PEROLEHAN, Length: 10848, dtype: object

In [9]:
df[cname[1]]

0        2018-05-22 00:00:00.0000000
1        2018-04-24 00:00:00.0000000
2        2018-05-22 00:00:00.0000000
3        2019-12-31 00:00:00.0000000
4        2018-05-07 00:00:00.0000000
                    ...
10843    2018-08-29 00:00:00.0000000
10844    2018-03-02 00:00:00.0000000
10845    2018-04-10 00:00:00.0000000
10846    2018-04-10 00:00:00.0000000
10847    2018-04-10 00:00:00.0000000
Name: TGL_BUKU, Length: 10848, dtype: object

In [10]:
df = convert_todate(df, column_name=cname[1])
df[cname[1]]

0        2018-05-22
1        2018-04-24
2        2018-05-22
3        2019-12-31
4        2018-05-07
            ...
10843    2018-08-29
10844    2018-03-02
10845    2018-04-10
10846    2018-04-10
10847    2018-04-10
Name: TGL_BUKU, Length: 10848, dtype: object

In [11]:
df[cname[2]]

0        2018-05-22 00:00:00.0000000
1        2018-04-24 00:00:00.0000000
2        2018-05-22 00:00:00.0000000
3        2019-12-31 00:00:00.0000000
4        2018-05-07 00:00:00.0000000
                    ...
10843    2018-08-29 00:00:00.0000000
10844    2018-03-02 00:00:00.0000000
10845    2018-04-10 00:00:00.0000000
10846    2018-04-10 00:00:00.0000000
10847    2018-04-10 00:00:00.0000000
Name: TGL_REKAM, Length: 10848, dtype: object

In [12]:
df = convert_todate(df, column_name=cname[2])
df[cname[2]]

0        2018-05-22
1        2018-04-24
2        2018-05-22
3        2019-12-31
4        2018-05-07
            ...
10843    2018-08-29
10844    2018-03-02
10845    2018-04-10
10846    2018-04-10
10847    2018-04-10
Name: TGL_REKAM, Length: 10848, dtype: object

In [13]:
df[cname[3]]

0        2008-12-31 00:00:00.0000000
1        2008-12-31 00:00:00.0000000
2        2008-12-31 00:00:00.0000000
3        2010-06-30 00:00:00.0000000
4        2018-05-07 00:00:00.0000000
                    ...
10843    2009-10-03 00:00:00.0000000
10844    2012-06-30 00:00:00.0000000
10845    2012-06-30 00:00:00.0000000
10846    2012-06-30 00:00:00.0000000
10847    2012-06-30 00:00:00.0000000
Name: TGL_REKAM_PERTAMA, Length: 10848, dtype: object

In [14]:
df = convert_todate(df, column_name=cname[3])
df[cname[3]]

0        2008-12-31
1        2008-12-31
2        2008-12-31
3        2010-06-30
4        2018-05-07
            ...
10843    2009-10-03
10844    2012-06-30
10845    2012-06-30
10846    2012-06-30
10847    2012-06-30
Name: TGL_REKAM_PERTAMA, Length: 10848, dtype: object

In [15]:
df[cname[4]]

0        1973-10-24 00:00:00.0000000
1                                NaN
2                                NaN
3        2009-03-27 00:00:00.0000000
4                                NaN
                    ...
10843                            NaN
10844    2989-10-02 00:00:00.0000000
10845    9191-03-26 00:00:00.0000000
10846    2005-03-14 00:00:00.0000000
10847    1999-01-01 00:00:00.0000000
Name: TGL_DANA, Length: 10848, dtype: object

In [16]:
df = convert_todate(df, column_name=cname[4])
df[cname[4]]

0        1973-10-24
1        0000-00-00
2        0000-00-00
3        2009-03-27
4        0000-00-00
            ...
10843    0000-00-00
10844    2989-10-02
10845    9191-03-26
10846    2005-03-14
10847    1999-01-01
Name: TGL_DANA, Length: 10848, dtype: object

In [17]:
df[cname[5]]

0        1973-10-24 00:00:00.0000000
1        2004-03-25 00:00:00.0000000
2        1995-12-31 00:00:00.0000000
3        2010-01-01 00:00:00.0000000
4        2008-04-01 00:00:00.0000000
                    ...
10843    1981-01-02 00:00:00.0000000
10844    1989-10-02 00:00:00.0000000
10845    1991-03-26 00:00:00.0000000
10846    2005-03-14 00:00:00.0000000
10847    1999-01-01 00:00:00.0000000
Name: TGL_PERLH, Length: 10848, dtype: object

In [18]:
df = convert_todate(df, column_name=cname[5])
df[cname[5]]

0        1973-10-24
1        2004-03-25
2        1995-12-31
3        2010-01-01
4        2008-04-01
            ...
10843    1981-01-02
10844    1989-10-02
10845    1991-03-26
10846    2005-03-14
10847    1999-01-01
Name: TGL_PERLH, Length: 10848, dtype: object

In [19]:
df[cname[6]]

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
10843    NaN
10844    NaN
10845    NaN
10846    NaN
10847    NaN
Name: TGL_PSP, Length: 10848, dtype: object

In [20]:
df = convert_todate(df, column_name=cname[6])
df[cname[6]]

0        0000-00-00
1        0000-00-00
2        0000-00-00
3        0000-00-00
4        0000-00-00
            ...
10843    0000-00-00
10844    0000-00-00
10845    0000-00-00
10846    0000-00-00
10847    0000-00-00
Name: TGL_PSP, Length: 10848, dtype: object

In [21]:
df['TGL_TARIK'] = df['TGL_TARIK'].fillna(0)
df['TGL_TARIK']

0        20200225.0
1        20200225.0
2        20200225.0
3        20200225.0
4        20200225.0
            ...
10843    20200225.0
10844    20200225.0
10845    20200225.0
10846    20200225.0
10847    20200225.0
Name: TGL_TARIK, Length: 10848, dtype: float64

In [22]:
df['TGL_TARIK'] = df['TGL_TARIK'].apply(np.int64)
df['TGL_TARIK']

0        20200225
1        20200225
2        20200225
3        20200225
4        20200225
           ...
10843    20200225
10844    20200225
10845    20200225
10846    20200225
10847    20200225
Name: TGL_TARIK, Length: 10848, dtype: int64

In [23]:
data = df
column_name = 'TGL_TARIK'

len_data = len(df)
# len_data = 10
data_series = []
for idx in range(len_data):
    len_data = len(df[column_name])
    data = df[column_name].iloc[idx]
    data = str(data)
    
    year = data[0:4]
    month = data[4:6]
    day = data[6:8]
    str_date = f'{year}-{month}-{day}'
#     print(str_date)

    try:
        at = arrow.get(str_date)
        date = at.date()
    except:
        str_date = f'0000-00-00'
#         at = arrow.get(str_date)
#         date = at.date()
        date = str_date
#         print(date)
#     print(date)

    data_series.append(date)

df[column_name] = data_series
df[column_name]
# return df

0        2020-02-25
1        2020-02-25
2        2020-02-25
3        2020-02-25
4        2020-02-25
            ...
10843    2020-02-25
10844    2020-02-25
10845    2020-02-25
10846    2020-02-25
10847    2020-02-25
Name: TGL_TARIK, Length: 10848, dtype: object

In [24]:
from sqlalchemy import create_engine

engine = create_engine('mysql://root:191618@localhost/db_logpolri')

In [25]:
df.to_sql('t_ASET_TANAH', con=engine, if_exists='append', chunksize=500, index=False)

/opt/anaconda3/envs/work/lib/python3.7/site-packages/sqlalchemy/dialects/mysql/mysqldb.py:148: Warning: Data truncated for column 'UR_SATKER_PENGGUNA' at row 61
  rowcount = cursor.executemany(statement, parameters)
/opt/anaconda3/envs/work/lib/python3.7/site-packages/sqlalchemy/dialects/mysql/mysqldb.py:148: Warning: Data truncated for column 'UR_SATKER_PENGGUNA' at row 158
  rowcount = cursor.executemany(statement, parameters)
/opt/anaconda3/envs/work/lib/python3.7/site-packages/sqlalchemy/dialects/mysql/mysqldb.py:148: Warning: Data truncated for column 'UR_SATKER_PENGGUNA' at row 255
  rowcount = cursor.executemany(statement, parameters)
/opt/anaconda3/envs/work/lib/python3.7/site-packages/sqlalchemy/dialects/mysql/mysqldb.py:148: Warning: Data truncated for column 'UR_SATKER_PENGGUNA' at row 449
  rowcount = cursor.executemany(statement, parameters)